Revit 2026 API

# PDFExportOptionsSetNamingRule Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
```
```vb
Public Sub SetNamingRule (
	namingRule As IList(Of TableCellCombinedParameterData)
)
```
```cpp
public:
void SetNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
```
```fsharp
member SetNamingRule :
        namingRule : IList<TableCellCombinedParameterData> -> unit
```

#### Parameters

namingRule IListTableCellCombinedParameterData

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace